app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    if params[:author_id] #coming in under the wing of AUthor?
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all